In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\nikita uprety\anaconda3\lib\site-packages (2.2.9)

In [2]:
import mysql.connector
#importing database
database = mysql.connector.connect(
host="localhost",
user="root",
password="",
database="pythonclassdb"
)
db = database.cursor()

In [3]:
sql = "SELECT * FROM python"
db.execute(sql)
result=db.fetchall()
print(result)

[(1, 'Pop', 56, 65, 44, 35, 67, 300, 88.5, 'B'), (2, 'Tom', 88, 98, 78, 99, 77, 400, 89.0, 'A+'), (3, 'Monkey', 59, 74, 63, 67, 78, 350, 81.5, 'B+'), (4, 'Dommy', 66, 89, 77, 34, 67, 340, 82.0, 'B+'), (5, 'Cat', 78, 77, 80, 87, 65, 390, 87.0, 'A'), (6, 'Brownie', 40, 47, 35, 38, 44, 287, 75.0, 'B-'), (7, 'Whitey', 70, 77, 65, 68, 54, 300, 75.0, 'B'), (8, 'Nanny', 56, 56, 67, 43, 45, 233, 65.0, 'C'), (9, 'Bunny', 86, 85, 97, 93, 95, 450, 89.0, 'A+'), (10, 'Sunny', 86, 85, 97, 93, 95, 450, 89.0, 'A+')]

In [4]:
#select
sql = "SELECT * FROM python WHERE grade = 'A'"
db.execute(sql)
result=db.fetchall()
print(result)

[(5, 'Cat', 78, 77, 80, 87, 65, 390, 87.0, 'A')]

In [5]:

#insert
sql = "INSERT INTO python (sn, name, physics, chemistry, maths, english, nepali, total, percentage, grade) VALUES (11, 'Munny', 86, 85, 97, 93, 95, 450, 89, 'A+')"
db.execute(sql)

database.commit()

In [6]:
sql = "SELECT * FROM python"
db.execute(sql)
result=db.fetchall()
print(result)

[(1, 'Pop', 56, 65, 44, 35, 67, 300, 88.5, 'B'), (2, 'Tom', 88, 98, 78, 99, 77, 400, 89.0, 'A+'), (3, 'Monkey', 59, 74, 63, 67, 78, 350, 81.5, 'B+'), (4, 'Dommy', 66, 89, 77, 34, 67, 340, 82.0, 'B+'), (5, 'Cat', 78, 77, 80, 87, 65, 390, 87.0, 'A'), (6, 'Brownie', 40, 47, 35, 38, 44, 287, 75.0, 'B-'), (7, 'Whitey', 70, 77, 65, 68, 54, 300, 75.0, 'B'), (8, 'Nanny', 56, 56, 67, 43, 45, 233, 65.0, 'C'), (9, 'Bunny', 86, 85, 97, 93, 95, 450, 89.0, 'A+'), (10, 'Sunny', 86, 85, 97, 93, 95, 450, 89.0, 'A+'), (11, 'Munny', 86, 85, 97, 93, 95, 450, 89.0, 'A+')]

In [7]:
#insert from user input
name=input("Enter Name ")
p = int(input("Enter number of physics"))
c = int(input("Enter number of chemistry"))
m = int(input("Enter number of maths"))
e = int(input("Enter number of english"))
n = int(input("Enter number of nepali"))
total = p+c+m+e+n
per = total/5
if per>=80:
    grade='A'
elif per>=60:
    grade='B'
elif per>=45:
    grade='C'
else:
    grade='F'

sql = f"INSERT INTO python (name, physics, chemistry, maths, english, nepali, total, percentage, grade) VALUES ('{name}', {p}, {c}, {m}, {e}, {n}, {total}, {per}, '{grade}')"
db.execute(sql)
database.commit()

Enter Name Ankita
Enter number of physics60
Enter number of chemistry70
Enter number of maths40
Enter number of english30
Enter number of nepali88

In [8]:
sql = "SELECT * FROM python"
db.execute(sql)
result=db.fetchall()
print(result)

[(1, 'Pop', 56, 65, 44, 35, 67, 300, 88.5, 'B'), (2, 'Tom', 88, 98, 78, 99, 77, 400, 89.0, 'A+'), (3, 'Monkey', 59, 74, 63, 67, 78, 350, 81.5, 'B+'), (4, 'Dommy', 66, 89, 77, 34, 67, 340, 82.0, 'B+'), (5, 'Cat', 78, 77, 80, 87, 65, 390, 87.0, 'A'), (6, 'Brownie', 40, 47, 35, 38, 44, 287, 75.0, 'B-'), (7, 'Whitey', 70, 77, 65, 68, 54, 300, 75.0, 'B'), (8, 'Nanny', 56, 56, 67, 43, 45, 233, 65.0, 'C'), (9, 'Bunny', 86, 85, 97, 93, 95, 450, 89.0, 'A+'), (10, 'Sunny', 86, 85, 97, 93, 95, 450, 89.0, 'A+'), (11, 'Munny', 86, 85, 97, 93, 95, 450, 89.0, 'A+'), (12, 'Ankita', 60, 70, 40, 30, 88, 288, 57.6, 'C')]

In [10]:
#update
sql = "UPDATE python SET name = 'Pramit' WHERE python.sn= 8"
db.execute(sql)
database.commit()

In [11]:
sql = "SELECT * FROM python"
db.execute(sql)
result=db.fetchall()
print(result)

[(1, 'Pop', 56, 65, 44, 35, 67, 300, 68.5, 'B'), (2, 'Tom', 88, 98, 78, 99, 77, 400, 89.0, 'A'), (3, 'Monkey', 59, 74, 63, 67, 78, 350, 81.5, 'A'), (4, 'Dommy', 66, 89, 77, 34, 67, 340, 82.0, 'A'), (5, 'Cat', 78, 77, 80, 87, 65, 390, 87.0, 'A'), (6, 'Brownie', 40, 47, 35, 38, 44, 287, 75.0, 'B'), (7, 'Whitey', 70, 77, 65, 68, 54, 300, 75.0, 'B'), (8, 'Pramit', 56, 56, 67, 43, 45, 233, 55.0, 'C'), (9, 'Bunny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (10, 'Sunny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (11, 'Munny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (12, 'Ankita', 60, 70, 40, 30, 88, 288, 57.6, 'C')]

In [12]:
#update from user input
name=input("Enter Name ")
sn = int(input("Enter serial number"))
sql = f"UPDATE python SET name = '{name}' WHERE python.sn= {sn}"
db.execute(sql)
database.commit()

Enter Name Inkey
Enter serial number7

In [13]:
sql = "SELECT * FROM python"
db.execute(sql)
result=db.fetchall()
print(result)

[(1, 'Pop', 56, 65, 44, 35, 67, 300, 68.5, 'B'), (2, 'Tom', 88, 98, 78, 99, 77, 400, 89.0, 'A'), (3, 'Monkey', 59, 74, 63, 67, 78, 350, 81.5, 'A'), (4, 'Dommy', 66, 89, 77, 34, 67, 340, 82.0, 'A'), (5, 'Cat', 78, 77, 80, 87, 65, 390, 87.0, 'A'), (6, 'Brownie', 40, 47, 35, 38, 44, 287, 75.0, 'B'), (7, 'Inkey', 70, 77, 65, 68, 54, 300, 75.0, 'B'), (8, 'Pramit', 56, 56, 67, 43, 45, 233, 55.0, 'C'), (9, 'Bunny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (10, 'Sunny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (11, 'Munny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (12, 'Ankita', 60, 70, 40, 30, 88, 288, 57.6, 'C')]

In [14]:
#delete
sql = "DELETE FROM python WHERE sn= 8"
db.execute(sql)
database.commit()

In [15]:
sql = "SELECT * FROM python"
db.execute(sql)
result=db.fetchall()
print(result)

[(1, 'Pop', 56, 65, 44, 35, 67, 300, 68.5, 'B'), (2, 'Tom', 88, 98, 78, 99, 77, 400, 89.0, 'A'), (3, 'Monkey', 59, 74, 63, 67, 78, 350, 81.5, 'A'), (4, 'Dommy', 66, 89, 77, 34, 67, 340, 82.0, 'A'), (5, 'Cat', 78, 77, 80, 87, 65, 390, 87.0, 'A'), (6, 'Brownie', 40, 47, 35, 38, 44, 287, 75.0, 'B'), (7, 'Inkey', 70, 77, 65, 68, 54, 300, 75.0, 'B'), (9, 'Bunny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (10, 'Sunny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (11, 'Munny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (12, 'Ankita', 60, 70, 40, 30, 88, 288, 57.6, 'C')]

In [16]:
#delete from user input
sn = int(input("Enter serial number"))
sql = f"DELETE FROM python WHERE sn= {sn}"
db.execute(sql)
database.commit()

Enter serial number7

In [17]:
sql = "SELECT * FROM python"
db.execute(sql)
result=db.fetchall()
print(result)

[(1, 'Pop', 56, 65, 44, 35, 67, 300, 68.5, 'B'), (2, 'Tom', 88, 98, 78, 99, 77, 400, 89.0, 'A'), (3, 'Monkey', 59, 74, 63, 67, 78, 350, 81.5, 'A'), (4, 'Dommy', 66, 89, 77, 34, 67, 340, 82.0, 'A'), (5, 'Cat', 78, 77, 80, 87, 65, 390, 87.0, 'A'), (6, 'Brownie', 40, 47, 35, 38, 44, 287, 75.0, 'B'), (9, 'Bunny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (10, 'Sunny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (11, 'Munny', 86, 85, 97, 93, 95, 450, 89.0, 'A'), (12, 'Ankita', 60, 70, 40, 30, 88, 288, 57.6, 'C')]